apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_efuse_table.c
static const efuse_desc_t DIS_ICACHE[] =
{
  {
    40, 1  /* Disable Icache, */
  },
};

static const efuse_desc_t DIS_USB_JTAG[] =
{
  {
    41, 1  /* Disable USB JTAG, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_ICACHE[] =
{
  {
    42, 1  /* Disable Icache in download mode, */
  },
};

static const efuse_desc_t DIS_USB_DEVICE[] =
{
  {
    43, 1  /* Disable USB_DEVICE, */
  },
};

static const efuse_desc_t DIS_FORCE_DOWNLOAD[] =
{
  {
    44, 1  /* Disable force chip go to download mode function, */
  },
};

static const efuse_desc_t DIS_USB[] =
{
  {
    45, 1  /* Disable USB function, */
  },
};

static const efuse_desc_t DIS_CAN[] =
{
  {
    46, 1  /* Disable CAN function, */
  },
};

static const efuse_desc_t JTAG_SEL_ENABLE[] =
{
  {
    47, 1  /* Set this bit to enable selection between usb_to_jtag and pad_to_jtag through strapping gpio10 when both reg_dis_usb_jtag and reg_dis_pad_jtag are equal to 0., */
  },
};

static const efuse_desc_t SOFT_DIS_JTAG[] =
{
  {
    48, 2  /* Set these bits to disable JTAG in the soft way (odd number 1 means disable). JTAG can be enabled in HMAC module., */
  },
};

static const efuse_desc_t DIS_PAD_JTAG[] =
{
  {
    51, 1  /* Disable JTAG in the hard way. JTAG is disabled permanently., */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MANUAL_ENCRYPT[] =
{
  {
    52, 1  /* Disable flash encryption when in download boot modes., */
  },
};

static const efuse_desc_t USB_DREFH[] =
{
  {
    53, 2  /* Controls single-end input threshold vrefh 1.76 V to 2 V with step of 80 mV stored in eFuse., */
  },
};

static const efuse_desc_t USB_DREFL[] =
{
  {
    55, 2  /* Controls single-end input threshold vrefl 0.8 V to 1.04 V with step of 80 mV stored in eFuse., */
  },
};

static const efuse_desc_t USB_EXCHG_PINS[] =
{
  {
    57, 1  /* Exchange D+ D- pins, */
  },
};

static const efuse_desc_t VDD_SPI_AS_GPIO[] =
{
  {
    58, 1  /* Set this bit to vdd spi pin function as gpio, */
  },
};

static const efuse_desc_t BTLC_GPIO_ENABLE[] =
{
  {
    59, 2  /* Enable btlc gpio, */
  },
};

static const efuse_desc_t POWERGLITCH_EN[] =
{
  {
    61, 1  /* Set this bit to enable power glitch function, */
  },
};

static const efuse_desc_t POWER_GLITCH_DSENSE[] =
{
  {
    62, 2  /* Sample delay configuration of power glitch, */
  },
};

static const efuse_desc_t WDT_DELAY_SEL[] =
{
  {
    80, 2  /* Select RTC WDT time out threshold, */
  },
};

static const efuse_desc_t SPI_BOOT_CRYPT_CNT[] =
{
  {
    82, 3  /* SPI boot encrypt decrypt enable. odd number 1 enable. even number 1 disable, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE0[] =
{
  {
    85, 1  /* Enable revoke first secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE1[] =
{
  {
    86, 1  /* Enable revoke second secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE2[] =
{
  {
    87, 1  /* Enable revoke third secure boot key, */
  },
};

static const efuse_desc_t KEY_PURPOSE_0[] =
{
  {
    88, 4  /* Key0 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_1[] =
{
  {
    92, 4  /* Key1 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_2[] =
{
  {
    96, 4  /* Key2 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_3[] =
{
  {
    100, 4  /* Key3 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_4[] =
{
  {
    104, 4  /* Key4 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_5[] =
{
  {
    108, 4  /* Key5 purpose, */
  },
};

static const efuse_desc_t SECURE_BOOT_EN[] =
{
  {
    116, 1  /* Secure boot enable, */
  },
};

static const efuse_desc_t SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  {
    117, 1  /* Enable aggressive secure boot revoke, */
  },
};

static const efuse_desc_t FLASH_TPUW[] =
{
  {
    124, 4  /* Flash wait time after power up. (unit is ms). When value is 15. the time is 30 ms, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MODE[] =
{
  {
    128, 1  /* Disable download mode include boot_mode[3:0] is 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_LEGACY_SPI_BOOT[] =
{
  {
    129, 1  /* Disable_Legcy_SPI_boot mode include boot_mode[3:0] is 4, */
  },
};

static const efuse_desc_t UART_PRINT_CHANNEL[] =
{
  {
    130, 1  /* 0: UART0. 1: UART1, */
  },
};

static const efuse_desc_t FLASH_ECC_MODE[] =
{
  {
    131, 1  /* Set this bit to set flsah ecc mode. 0:flash ecc 16to18 byte mode. 1:flash ecc 16to17 byte mode, */
  },
};

static const efuse_desc_t DIS_USB_DOWNLOAD_MODE[] =
{
  {
    132, 1  /* Disable download through USB, */
  },
};

static const efuse_desc_t ENABLE_SECURITY_DOWNLOAD[] =
{
  {
    133, 1  /* Enable security download mode, */
  },
};

static const efuse_desc_t UART_PRINT_CONTROL[] =
{
  {
    134, 2  /* b00:force print. b01:control by GPIO46 - low level print. b10:control by GPIO46 - high level print. b11:force disable print., */
  },
};

static const efuse_desc_t PIN_POWER_SELECTION[] =
{
  {
    136, 1  /* GPIO33-GPIO37 power supply selection in ROM code. 0:VDD3P3_CPU. 1:VDD_SPI., */
  },
};

static const efuse_desc_t FLASH_TYPE[] =
{
  {
    137, 1  /* Connected Flash interface type. 0: 4 data line. 1: 8 data line, */
  },
};

static const efuse_desc_t FLASH_PAGE_SIZE[] =
{
  {
    138, 2  /* Flash page size, */
  },
};

static const efuse_desc_t FLASH_ECC_EN[] =
{
  {
    140, 1  /* Enable ECC for flash boot, */
  },
};

static const efuse_desc_t FORCE_SEND_RESUME[] =
{
  {
    141, 1  /* Force ROM code to send a resume command during SPI boot, */
  },
};

static const efuse_desc_t SECURE_VERSION[] =
{
  {
    142, 16  /* Secure version for anti-rollback, */
  },
};

static const efuse_desc_t MAC_FACTORY[] =
{
  {
    296, 8  /* Factory MAC addr [0], */
  },
  {
    288, 8  /* Factory MAC addr [1], */
  },
  {
    280, 8  /* Factory MAC addr [2], */
  },
  {
    272, 8  /* Factory MAC addr [3], */
  },
  {
    264, 8  /* Factory MAC addr [4], */
  },
  {
    256, 8  /* Factory MAC addr [5], */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_CLK[] =
{
  {
    304, 6  /* SPI_PAD_configure CLK, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_Q_D1[] =
{
  {
    310, 6  /* SPI_PAD_configure Q(D1), */
  },
};

