apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_efuse_table.c
const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D_D0[] =
{
  &SPI_PAD_CONFIG_D_D0[0],  /* SPI_PAD_configure D(D0) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_CS[] =
{
  &SPI_PAD_CONFIG_CS[0],  /* SPI_PAD_configure CS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_HD_D3[] =
{
  &SPI_PAD_CONFIG_HD_D3[0],  /* SPI_PAD_configure HD(D3) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_WP_D2[] =
{
  &SPI_PAD_CONFIG_WP_D2[0],  /* SPI_PAD_configure WP(D2) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_DQS[] =
{
  &SPI_PAD_CONFIG_DQS[0],  /* SPI_PAD_configure DQS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D4[] =
{
  &SPI_PAD_CONFIG_D4[0],  /* SPI_PAD_configure D4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D5[] =
{
  &SPI_PAD_CONFIG_D5[0],  /* SPI_PAD_configure D5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D6[] =
{
  &SPI_PAD_CONFIG_D6[0],  /* SPI_PAD_configure D6 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D7[] =
{
  &SPI_PAD_CONFIG_D7[0],  /* SPI_PAD_configure D7 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SYS_DATA_PART1[] =
{
  &SYS_DATA_PART1[0],  /* System configuration */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USER_DATA[] =
{
  &USER_DATA[0],  /* User data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY0[] =
{
  &KEY0[0],  /* Key0 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY1[] =
{
  &KEY1[0],  /* Key1 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY2[] =
{
  &KEY2[0],  /* Key2 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY3[] =
{
  &KEY3[0],  /* Key3 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY4[] =
{
  &KEY4[0],  /* Key4 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY5[] =
{
  &KEY5[0],  /* Key5 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SYS_DATA_PART2[] =
{
  &SYS_DATA_PART2[0],  /* System configuration */
  NULL
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/
